devdnl/dnx-rtos/src/system/drivers/clk/stm32f4/clk.c
/*=========================================================================*//**
@file    clk.c

@author  Daniel Zorychta

@brief   File support system clokc (PLL).

@note    Copyright (C) 2017 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f4/clk_cfg.h"
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#include "../clk_ioctl.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define TIMEOUT_MS                      250
#define LSE_TIMEOUT_MS                  5000

#define PWR_REGULATOR_VOLTAGE_SCALE0    (0)
#define PWR_REGULATOR_VOLTAGE_SCALE1    ((1*PWR_CR_VOS_1) | (1*PWR_CR_VOS_0))
#define PWR_REGULATOR_VOLTAGE_SCALE2    ((1*PWR_CR_VOS_1) | (0*PWR_CR_VOS_0))
#define PWR_REGULATOR_VOLTAGE_SCALE3    ((0*PWR_CR_VOS_1) | (1*PWR_CR_VOS_0))

/*==============================================================================
  Local types, enums definitions
==============================================================================*/

/*==============================================================================
  Local function prototypes
==============================================================================*/
static int  configure_core_voltage_and_flash_latency(void);
static void enable_prefetch_buffer(void);
static int  wait_for_flag(u32_t flag, u32_t timeout);
static bool is_APB1_divided(void);
static bool is_APB2_divided(void);

/*==============================================================================
  Local object definitions
==============================================================================*/

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 * @param[in ]            config               optional module configuration
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(CLK, void **device_handle, u8_t major, u8_t minor, const void *config)
{
        UNUSED_ARG4(device_handle, major, minor, config);

        RCC_DeInit();

        int err = 0;
        err = configure_core_voltage_and_flash_latency();
        if (err) {
                return err;
        }

        enable_prefetch_buffer();

        //----------------------------------------------------------------------
        // MCOx clock sources and prescalers
        //----------------------------------------------------------------------
        RCC_MCO1Config(_CLK_CFG__MCO1_SRC, _CLK_CFG__MCO1_DIV);
        RCC_MCO2Config(_CLK_CFG__MCO2_SRC, _CLK_CFG__MCO2_DIV);

        //----------------------------------------------------------------------
        // LSI OSCILLATOR
        //----------------------------------------------------------------------
        if (_CLK_CFG__LSI_ON) {
                RCC_LSICmd(_CLK_CFG__LSI_ON);
                err = wait_for_flag(RCC_FLAG_LSIRDY, TIMEOUT_MS);
                if (err) {
                        printk("CLK: LSI timeout");
                        return err;
                }
        }

        //----------------------------------------------------------------------
        // LSE OSCILLATOR
        //----------------------------------------------------------------------
        if (_CLK_CFG__LSE_ON) {

                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);
                SET_BIT(PWR->CR, PWR_CR_DBP);

                if (!(RCC->BDCR & RCC_BDCR_LSERDY)) {

                        RCC_LSEConfig(_CLK_CFG__LSE_ON);

                        if (_CLK_CFG__LSE_ON != RCC_LSE_Bypass) {
                                // this oscillator not causes an error because is not a main osc.
                                if (wait_for_flag(RCC_FLAG_LSERDY, LSE_TIMEOUT_MS) != ESUCC) {
                                        // this oscillator not causes an error because is not a main osc.
                                        printk("CLK: LSE timeout");
                                }
                        }
                }
        }

        //----------------------------------------------------------------------
        // HSE OSCILLATOR
        //----------------------------------------------------------------------
        if (_CLK_CFG__HSE_ON) {
                RCC_HSEConfig(_CLK_CFG__HSE_ON);
                err = wait_for_flag(RCC_FLAG_HSERDY, TIMEOUT_MS);
                if (err) {
                        printk("CLK: HSE timeout");
                        return err;
                }
        }

        //----------------------------------------------------------------------
        // RTC clock selection
        //----------------------------------------------------------------------
        if ( (  (_CLK_CFG__RTCCLK_SRC == RCC_RTCCLKSource_LSE && _CLK_CFG__LSE_ON)
             || (_CLK_CFG__RTCCLK_SRC == RCC_RTCCLKSource_LSI && _CLK_CFG__LSI_ON)
             || (IS_RCC_RTCCLK_SOURCE(_CLK_CFG__RTCCLK_SRC)   && _CLK_CFG__HSE_ON) )

