devdnl/dnx-rtos/src/system/drivers/clk/stm32f4/clk.c
           && (RCC->BDCR & RCC_BDCR_RTCEN) == 0
           && (RCC->BDCR & (RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0)) == 0) {

                SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);
                SET_BIT(PWR->CR, PWR_CR_DBP);
                RCC_RTCCLKConfig(_CLK_CFG__RTCCLK_SRC);
        }

        //----------------------------------------------------------------------
        // SAI clock source
        //----------------------------------------------------------------------
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) || defined(STM32F469_479xx)
        RCC_SAIPLLSAIClkDivConfig(_CLK_CFG__SAI_PLLSAI_CLK_DIV);
        RCC_SAIPLLI2SClkDivConfig(_CLK_CFG__SAI_PLLI2S_CLK_DIV);
#endif

#if defined(STM32F413_423xx)
        RCC_SAIPLLI2SRClkDivConfig(_CLK_CFG__SAI_PLLI2S_CLK_DIVR);
        RCC_SAIPLLRClkDivConfig(_CLK_CFG__SAI_PLL_CLK_DIVR);
#endif

#if defined(STM32F446xx)
        RCC_SAICLKConfig(RCC_SAIInstance_SAI1, _CLK_CFG__SAI1_CLK_SRC);
        RCC_SAICLKConfig(RCC_SAIInstance_SAI2, _CLK_CFG__SAI2_CLK_SRC);
#endif

#if defined(STM32F413_423xx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx)
        RCC_SAIBlockACLKConfig(_CLK_CFG__SAI_BLOCK_A_CLK_SRC);
        RCC_SAIBlockBCLKConfig(_CLK_CFG__SAI_BLOCK_B_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // LTDC clock source
        //----------------------------------------------------------------------
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx)
        RCC_LTDCCLKDivConfig(_CLK_CFG__LTDC_CLK_DIV);
#endif

        //----------------------------------------------------------------------
        // DFSDM clock source
        //----------------------------------------------------------------------
#if defined(STM32F412xG) || defined(STM32F413_423xx)
        RCC_DFSDM1CLKConfig(_CLK_CFG__DFSDM1_CLK_SRC);
        RCC_DFSDM1ACLKConfig(_CLK_CFG__DFSDM1_ACLK_SRC);

#if defined(STM32F413_423xx)
        RCC_DFSDM2ACLKConfig(_CLK_CFG__DFSDM2_ACLK_SRC);
#endif
#endif

        //----------------------------------------------------------------------
        // DSI clock source
        //----------------------------------------------------------------------
#if defined(STM32F469_479xx)
        RCC_DSIClockSourceConfig(_CLK_CFG__DSI_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // DFSDM clock source
        //----------------------------------------------------------------------
#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx) || defined(STM32F469_479xx)
        RCC_48MHzClockSourceConfig(_CLK_CFG__48MHZ_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // SDIO clock source
        //----------------------------------------------------------------------
#if defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx) || defined(STM32F469_479xx)
        RCC_SDIOClockSourceConfig(_CLK_CFG__SDIO_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // SPDIF clock source
        //----------------------------------------------------------------------
#if defined(STM32F446xx)
        RCC_SPDIFRXClockSourceConfig(_CLK_CFG__SPDIF_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // CEC clock source
        //----------------------------------------------------------------------
#if defined(STM32F446xx)
        RCC_CECClockSourceConfig(_CLK_CFG__CEC_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // FMPI2C clock source
        //----------------------------------------------------------------------
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx)
        RCC_FMPI2C1ClockSourceConfig(_CLK_CFG__FMPI2C1_CLK_SRC);
#endif

        //----------------------------------------------------------------------
        // Main PLL configuration
        //----------------------------------------------------------------------
#if defined(STM32F410xx) || defined(STM32F412xG) || defined(STM32F413_423xx) || defined(STM32F446xx) || defined(STM32F469_479xx)
        RCC_PLLConfig(_CLK_CFG__PLL_SRC,
                      _CLK_CFG__PLL_SRC_DIV_M,
                      _CLK_CFG__PLL_N,
                      _CLK_CFG__PLL_P,
                      _CLK_CFG__PLL_Q,
                      _CLK_CFG__PLL_R);
#endif

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE)
        RCC_PLLConfig(_CLK_CFG__PLL_SRC,
                      _CLK_CFG__PLL_SRC_DIV_M,
                      _CLK_CFG__PLL_N,
                      _CLK_CFG__PLL_P,
                      _CLK_CFG__PLL_Q);
#endif

        RCC_PLLCmd(_CLK_CFG__PLL_ON);
        if (_CLK_CFG__PLL_ON) {
                err = wait_for_flag(RCC_FLAG_PLLRDY, TIMEOUT_MS);
                if (err) {
                        printk("CLK: PLL timeout");
                        return err;
                }
        }

        //----------------------------------------------------------------------
        // I2S PLL configuration
        //----------------------------------------------------------------------
#if defined(STM32F40_41xxx) || defined(STM32F401xx)
        RCC_PLLI2SConfig(_CLK_CFG__PLLI2S_N, _CLK_CFG__PLLI2S_R);
#endif

#if defined(STM32F411xE)
        RCC_PLLI2SConfig(_CLK_CFG__PLLI2S_N, _CLK_CFG__PLLI2S_R, _CLK_CFG__PLLI2S_M);
#endif

#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx)
        RCC_PLLI2SConfig(_CLK_CFG__PLLI2S_N, _CLK_CFG__PLLI2S_Q, _CLK_CFG__PLLI2S_R);
#endif

#if defined(STM32F412xG ) || defined(STM32F413_423xx) || defined(STM32F446xx)
        RCC_PLLI2SConfig(_CLK_CFG__PLLI2S_M, _CLK_CFG__PLLI2S_N, _CLK_CFG__PLLI2S_P,
                         _CLK_CFG__PLLI2S_Q, _CLK_CFG__PLLI2S_R);
#endif

