devdnl/dnx-rtos/src/system/drivers/clk/stm32f4/clk.c
        int err = EINVAL;

        if (arg) {
                if (request == IOCTL_CLK__GET_CLK_INFO) {
                        LL_RCC_ClocksTypeDef freq;
                        LL_RCC_GetSystemClocksFreq(&freq);

                        CLK_info_t *clkinf = arg;

                        switch (clkinf->iterator) {
                        case 0:
                                clkinf->freq_Hz = freq.SYSCLK_Frequency;
                                clkinf->name = "CPUCLK";
                                break;

                        case 1:
                                clkinf->freq_Hz = freq.SYSCLK_Frequency;
                                clkinf->name = "SYSCLK";
                                break;

                        case 2:
                                clkinf->freq_Hz = freq.HCLK_Frequency;
                                clkinf->name = "HCLK";
                                break;

                        case 3:
                                clkinf->freq_Hz = freq.PCLK1_Frequency;
                                clkinf->name = "PCLK1";
                                break;

                        case 4:
                                clkinf->freq_Hz = freq.PCLK2_Frequency;
                                clkinf->name = "PCLK2";
                                break;

                        case 5:
                                if (is_APB1_divided()) {
                                        clkinf->freq_Hz = freq.PCLK1_Frequency * 2;
                                } else {
                                        clkinf->freq_Hz = freq.PCLK1_Frequency;
                                }
                                clkinf->name = "PCLK1_TIM";
                                break;

                        case 6:
                                if (is_APB2_divided()) {
                                        clkinf->freq_Hz = freq.PCLK2_Frequency * 2;
                                } else {
                                        clkinf->freq_Hz = freq.PCLK2_Frequency;
                                }
                                clkinf->name = "PCLK2_TIM";
                                break;

                        default:
                                clkinf->freq_Hz = 0;
                                clkinf->name = NULL;
                                break;
                        }

                        clkinf->iterator++;

                        err = ESUCC;
                } else {
                        err = EBADRQC;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(CLK, void *device_handle)
{
        UNUSED_ARG1(device_handle);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(CLK, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG2(device_handle, device_stat);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Function set flash latency (wait states)
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure_core_voltage_and_flash_latency(void)
{
        int err = 0;

        SET_BIT(RCC->APB1ENR, RCC_APB1ENR_PWREN);

        u32_t hclk = __CLK_HCLK_FREQ__ / 1000000;

        u32_t VOS;
        if (hclk <= 144) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE2;
        } else if (hclk <= 168) {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE1;
        } else {
                VOS = PWR_REGULATOR_VOLTAGE_SCALE0;
        }

        // Set the core voltage
        if ((PWR->CR & PWR_CR_VOS) != VOS) {
                u32_t VOS_tmp = (VOS == PWR_REGULATOR_VOLTAGE_SCALE0) ? PWR_REGULATOR_VOLTAGE_SCALE1 : VOS;
                MODIFY_REG(PWR->CR, PWR_CR_VOS_Msk, VOS_tmp);

                // Enable core boost voltage
                #if defined(PWR_CR_ODEN)
                if (!err && (VOS == PWR_REGULATOR_VOLTAGE_SCALE0)) {
                        SET_BIT(PWR->CR, PWR_CR_ODEN);
                        u64_t tref = sys_time_get_reference();
                        while (not (PWR->CSR & PWR_CSR_ODRDY)) {
                                if (sys_time_is_expired(tref, TIMEOUT_MS)) {
                                        printk("CLK: VOS0 timeout");
                                        err = ETIME;
                                        break;
                                }

                                sys_sleep_ms(1);
                        }
                }
                #endif
        }

        if (!err) {
                u64_t tref = sys_time_get_reference();
                while (not sys_time_is_expired(tref, TIMEOUT_MS)) {
                        MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY_Msk, _CLK_CFG__FLASH_LATENCY);
                        if ((FLASH->ACR & FLASH_ACR_LATENCY_Msk) == _CLK_CFG__FLASH_LATENCY) {
                                break;
                        }
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function enable prefetch buffer
 */
//==============================================================================
static void enable_prefetch_buffer(void)
{
        SET_BIT(FLASH->ACR, FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN);
}

//==============================================================================
/**
 * @brief Wait for flag set
 *
 * ERRNO: EIO
 *
 * @param flag          flag
 *
 * @return ESUCC if success, ETIME on error
 */
//==============================================================================
static int wait_for_flag(u32_t flag, u32_t timeout)
{
        u32_t timer = sys_time_get_reference();
        while (RCC_GetFlagStatus(flag) == RESET) {
                if (sys_time_is_expired(timer, timeout)) {
                        return ETIME;
                }
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function return APB1 divider
 *
 * @return true if APB1 is divided, false if not
 */
//==============================================================================
static bool is_APB1_divided(void)
{
        return (RCC->CFGR & RCC_CFGR_PPRE1_2);
}

//==============================================================================
/**
 * @brief Function return APB2 divider
 *
 * @return true if APB2 is divided, false if not
 */
//==============================================================================
static bool is_APB2_divided(void)
{
        return (RCC->CFGR & RCC_CFGR_PPRE2_2);
}

/*==============================================================================
  End of file
==============================================================================*/
